000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/РегистрацияБиометрии/РегистрацияБиометрии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РегистрацияБиометрии</name>
  <attributes>
    <name>Подключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Зарегистрирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>ОтделМагазина</name>
    <type>
      <types>CatalogRef.ОтделыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСотрудника</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ПринятНаНовоеРабочееМесто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <comment>Идентификатор внешнего документа - для обеспечения уникальности записи</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СостояниеРаботниковОрганизаций/СостояниеРаботниковОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРаботниковОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРаботникаОрганизации</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеЗавершения</name>
    <type>
      <types>EnumRef.СостоянияРаботникаОрганизации</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументДвиженияПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/БиометрическиеДанные/БиометрическиеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиометрическиеДанные</name>
  <resources>
    <name>Биометрия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетРабочегоВремениФакт/УчетРабочегоВремениФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремениФакт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ЗаписаноЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВремени</name>
    <type>
      <types>EnumRef.ТипВремени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОрганизацииПодразделений/ОрганизацииПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОрганизацииПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <comment>Элемент справочника, периодичность реквизита которого мы обеспечиваем.</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.Магазины</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/УчетнаяПолитикаМагазинов/УчетнаяПолитикаМагазинов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаМагазинов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодарочныйСертификатКакСкидка</name>
    <comment>иначе - как тип оплпты (типовой механизм)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуУслуг</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуТоварОбычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуТоварСпециальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеПечататьСлипЧекПриОплате</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезерваТовараПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриПроведенииОтправлятьВNavision</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БлокироватьИзменениеСуммыОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УслугаСтрахования</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьВерификациюПокупателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БлокироватьДвиженияПоПересчетуСамостоятельному</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьWEBПередачуОбъектовВЦБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьWEBЗагрузкуЗаказовПокупателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБанковскиеУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_РазрешитьОбменВходящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_РазрешитьОбменИсходящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_ПродажиАктивированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_УправлениеЦенниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>CRM_ТаймаутРасчетаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>CRM_ТаймаутКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НоменклатуруСегментаФормироватьНаПериферии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьВнешнююОбработкуРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОкруглениеВЧекеККМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьКонтрольПодарочныхСертификатов</name>
    <comment>Предохранитель многовекторности проверок.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвторасчетНДС_РРО</name>
    <comment>ЧекККМ, ОтчетОРозничныхПродажах.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвторасчетНДС_Прочие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьNavisionРегламентомОрдерПроведенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОплатуБонусамиНеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОтказВерификацииКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОграничитьОтгрузкуРеализованногоЗаказаПокупателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьОграниченияПериодаПоКассовомуДню</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЦеныCompetera</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьОбновлениеБонусныхБалловРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольОрганизацииПодарочногоСертификата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБиометрическийСканер</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НовыеСтикеры</name>
    <comment>30 х 30</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛокалЕкспрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПосылокЛокалЕкспрес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьОкруглениеПоДокументу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <comment>Если пустой - значит, по всем магазинам, для которых НЕТ конкретной записи</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СостоянияРаботникаОрганизации/СостоянияРаботникаОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРаботникаОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Работает</name>
  </enumValues>
  <enumValues>
    <name>НеРаботает</name>
  </enumValues>
  <enumValues>
    <name>Заболевание</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтпускЕжегодный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетПоНевыясненнойПричине</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныеОбязанности</name>
  </enumValues>
  <enumValues>
    <name>Прогулы</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>Мобилизован</name>
  </enumValues>
  <enumValues>
    <name>ДругиеНеявки</name>
  </enumValues>
  <enumValues>
    <name>ПриостановкаТрудовогоДоговора</name>
    <comment>Приостановка трудового договора</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/РегистрацияБиометрии/Forms/Форма/Module.bsl
&НаСервере
Процедура МагазинПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                |	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	                |	РаботникиОрганизаций.Должность КАК Должность,
	                |	РаботникиОрганизаций.Магазин КАК Магазин,
	                |	ВЫБОР
	                |		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(БиометрическиеДанные.Биометрия КАК СТРОКА(10)), ЛОЖЬ) = ЛОЖЬ
	                |			ТОГДА ЛОЖЬ
	                |		ИНАЧЕ ИСТИНА
	                |	КОНЕЦ КАК Зарегистрирован
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		РаботникиОрганизаций.Организация КАК Организация,
	                |		РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	                |		МАКСИМУМ(РаботникиОрганизаций.ПериодНачала) КАК ПериодНачала
	                |	ИЗ
	                |		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		РаботникиОрганизаций.Организация,
	                |		РаботникиОрганизаций.Сотрудник) КАК ВложенныйЗапрос1
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	                |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |				СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	                |				МАКСИМУМ(СостояниеРаботниковОрганизацийСрезПоследних.Период) КАК Период,
	                |				СостояниеРаботниковОрганизацийСрезПоследних.Организация КАК Организация
	                |			ИЗ
	                |				РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних КАК СостояниеРаботниковОрганизацийСрезПоследних
	                |			ГДЕ
	                |				СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.Уволен = ЛОЖЬ
	                |				И СостояниеРаботниковОрганизацийСрезПоследних.Организация = &Организация
	                |				И СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник.Магазин = &Магазин
	                |			
	                |			СГРУППИРОВАТЬ ПО
	                |				СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник,
	                |				СостояниеРаботниковОрганизацийСрезПоследних.Организация) КАК ВложенныйЗапрос
	                |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних КАК СостояниеРаботниковОрганизацийСрезПоследних
	                |				ПО ВложенныйЗапрос.Сотрудник = СостояниеРаботниковОрганизацийСрезПоследних.Сотрудник
	                |					И ВложенныйЗапрос.Период = СостояниеРаботниковОрганизацийСрезПоследних.Период
	                |			ПО РаботникиОрганизаций.Сотрудник = ВложенныйЗапрос.Сотрудник
	                |				И РаботникиОрганизаций.Организация = ВложенныйЗапрос.Организация
	                |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БиометрическиеДанные КАК БиометрическиеДанные
	                |			ПО РаботникиОрганизаций.Сотрудник = БиометрическиеДанные.ФизЛицо
	                |		ПО ВложенныйЗапрос1.Организация = РаботникиОрганизаций.Организация
	                |			И ВложенныйЗапрос1.Сотрудник = РаботникиОрганизаций.Сотрудник
	                |			И ВложенныйЗапрос1.ПериодНачала = РаботникиОрганизаций.ПериодНачала
	                |ГДЕ
	                |	(ЕСТЬNULL(СостояниеРаботниковОрганизацийСрезПоследних.Состояние, 0) = 0
	                |			ИЛИ СостояниеРаботниковОрганизацийСрезПоследних.Состояние В (&СостоянияРаботающих)
	                |			ИЛИ СостояниеРаботниковОрганизацийСрезПоследних.ПериодЗавершения < &КонецПериода
	                |				И СостояниеРаботниковОрганизацийСрезПоследних.СостояниеЗавершения В (&СостоянияРаботающих))
	                |	И РаботникиОрганизаций.Сотрудник.Магазин = &Магазин
	                |	И РаботникиОрганизаций.Сотрудник.Уволен = ЛОЖЬ
	                |	И РаботникиОрганизаций.Организация = &Организация
	                |	И РаботникиОрганизаций.ЗанимаемыхСтавок > 0";
   
	
	
	//2025-07-02 sa Нужно подсвечивать цветом уволенных сотрудников. для этого нужно определить в каком они состоянии находятся.
	МассивСостоянийРаботающихСотрудников = Новый Массив;
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.Работает);
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный);
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.ПриостановкаТрудовогоДоговора);
	МассивСостоянийРаботающихСотрудников.Добавить(Перечисления.СостоянияРаботникаОрганизации.ОтпускУчебный);
	
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("Организация", ПолучитьОрганизацию(Магазин));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("СостоянияРаботающих", МассивСостоянийРаботающихСотрудников);
	вТЗ = Запрос.Выполнить().Выгрузить();
	//2025-09-26 sa пока продолжается бардак с обменом, будем добавлять еще сотрудников которые табелировались за последние 30 дней (вне зависимости от того
	//в каком состоянии они находятся. Ибо из-за проблем с обменом это состояние может быть неравильным)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УчетРабочегоВремениФакт.Организация КАК Организация,
	               |	УчетРабочегоВремениФакт.Магазин КАК Магазин,
	               |	УчетРабочегоВремениФакт.Сотрудник КАК Сотрудник,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(БиометрическиеДанные.Биометрия КАК СТРОКА(10)), 0) = 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Зарегистрирован
	               |ИЗ
	               |	РегистрСведений.УчетРабочегоВремениФакт КАК УчетРабочегоВремениФакт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БиометрическиеДанные КАК БиометрическиеДанные
	               |		ПО УчетРабочегоВремениФакт.Сотрудник = БиометрическиеДанные.ФизЛицо
	               |ГДЕ
	               |	УчетРабочегоВремениФакт.Период >= &НачалоПериода
	               |	И УчетРабочегоВремениФакт.Магазин = &Магазин
	               |	И УчетРабочегоВремениФакт.Организация = &Организация";   
	Запрос.УстановитьПараметр("НачалоПериода",ТекущаяДата()-30*86400);
	Запрос.УстановитьПараметр("КонецПериода",ТекущаяДата());
	Запрос.УстановитьПараметр("Организация", ПолучитьОрганизацию(Магазин));
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Рез_ = Запрос.Выполнить().Выбрать();

	Пока Рез_.Следующий() Цикл
		СтрокаСотрудник = вТЗ.Найти(Рез_.Сотрудник,"Сотрудник");
		Если СтрокаСотрудник<>Неопределено Тогда
			Продолжить;
		КонецЕсли;     
		
		СтрокаТЗ = вТЗ.Добавить();
		СтрокаТЗ.Сотрудник = Рез_.Сотрудник;
		СтрокаТЗ.Зарегистрирован = Рез_.Зарегистрирован;
	КонецЦикла;
	
	Объект.Сотрудники.Загрузить(вТЗ);
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизацию(Магазин_)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаОрганизаций.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&ТекущаяДата, Владелец = &Ссылка) КАК ТаблицаОрганизаций"
	);
	Запрос.УстановитьПараметр("Ссылка"		, Магазин_);
	Запрос.УстановитьПараметр("ТекущаяДата"	, ТекущаяДата());

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
	
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();

			Организация = Выборка.Организация;

	Иначе	Организация = Неопределено;
	
	КонецЕсли;
	
	Возврат Организация;
КонецФункции

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	МагазинПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗарегистрировать(Команда)
	ТекСтрока = Элементы.Сотрудники.ТекущиеДанные; 
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Сотрудник", ТекСтрока.Сотрудник);
	//2025-09-15 sa дополнительная проверка что сотрудник указан
	Если Не ЗначениеЗаполнено(ТекСтрока.Сотрудник) Тогда
		Сообщить("Не вказано співробітника для якого реєструється біометрія!");
		Возврат;
	КонецЕсли;

	Если ТекСтрока.Зарегистрирован Тогда
		Оповещение_ = Новый ОписаниеОповещения("ИдентификацияЗавершение",ЭтаФорма,СтруктураПараметров);
		ФормаРегистрации = ОткрытьФормуМодально("Обработка.РегистрацияБиометрии.Форма.ФормаИдентификации",СтруктураПараметров,ЭтаФорма);
        ИдентификацияЗавершение(ФормаРегистрации,СтруктураПараметров);
	Иначе
		Оповещение_ = Новый ОписаниеОповещения("ЗарегистрироватьЗавершение",ЭтаФорма,СтруктураПараметров);
		ФормаРегистрации = ОткрытьФормуМодально("Обработка.РегистрацияБиометрии.Форма.ФормаРегистрация",СтруктураПараметров,ЭтаФорма);
        ЗарегистрироватьЗавершение(ФормаРегистрации,СтруктураПараметров);
	КонецЕсли;
	
	
КонецПроцедуры    

&НаКлиенте
Процедура  ЗарегистрироватьЗавершение(РезультатПараметры,ДопПараметры) Экспорт 
	Если Не ТипЗнч(РезультатПараметры) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;                  
	Если РезультатПараметры.Свойство("Успешно") И РезультатПараметры.Успешно = Истина Тогда        
		МагазинПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры      

&НаКлиенте
Процедура  ИдентификацияЗавершение(РезультатПараметры,ДопПараметры) Экспорт
	Если Не ТипЗнч(РезультатПараметры) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;                  
	Если РезультатПараметры.Свойство("Успешно") И РезультатПараметры.Успешно = Истина Тогда        
		УдалитьБиометрическиеДанныеСервер(РезультатПараметры.Сотрудник);
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Сотрудник", РезультатПараметры.Сотрудник);
		Оповещение_ = Новый ОписаниеОповещения("ЗарегистрироватьЗавершение",ЭтаФорма, Новый Структура);
		ФормаРегистрации = ОткрытьФормуМодально("Обработка.РегистрацияБиометрии.Форма.ФормаРегистрация",СтруктураПараметров,ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры      

&НаСервере
Процедура УдалитьБиометрическиеДанныеСервер(ТекСотрудник)
		РаботаСБиометричекимиДанными.УдалитьБиометриюСотруднику(ТекСотрудник);
КонецПроцедуры      

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЕстьПравоДоступаИзменятьБиометрическиеДанные() Тогда
		//Отказ = Истина; //2025-09-10 sa Нафиг здесь кому-то что-то запрещать?
		ПоказатьОповещениеПользователя("Перевірка можливості користування обробкою"
		,, "У вас немає права використовувати обробку для реєстрації біометричних даних!"
		, БиблиотекаКартинок.Ошибка32, СтатусОповещенияПользователя.Важное);
		
	КонецЕсли;   
	
	//2025-09-24 sa нужно не давать возможность держать открытой и обработку регистрации и табелирования персонала.
	Окна_ = ПолучитьОкна();
	Для каждого Окно_ из Окна_ Цикл
		//можно и через содержимое формы, но это заморочено.
		//Если Окно_.Содержимое.Количество() = 0 Тогда
		//	Продолжить;
		//КонецЕсли;
		//Если Окно_.Содержимое[0].ИмяФормы = "Обработка.УчетРабочегоВремениБиосканер.Форма.Форма" Тогда
		//КонецЕсли;
		
		Если Окно_.Заголовок = "Облік робочого часу (біосканер)" Тогда
			Отказ = Истина;

			ПоказатьОповещениеПользователя("Перевірка можливості користування обробкою"
			,, "У вас відкрита обробка Табелюваня персоналу!"+Символы.ПС+"Треба її закрити щоб маєти можливість використовувати обробку для реєстрації біометричних даних!"
			, БиблиотекаКартинок.Ошибка32, СтатусОповещенияПользователя.Важное);
		КонецЕсли;
		//Сообщить(Окно_.Заголовок)
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Функция  ЕстьПравоДоступаИзменятьБиометрическиеДанные()  
	Возврат Истина;
	//Возврат РольДоступна("ДобавлениеИзменениеБиометрическихДанных");
КонецФункции

&НаСервереБезКонтекста
Функция  ПолучитьМагазиныИспользующиеБиометрику()  
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УчетнаяПолитикаМагазиновСрезПоследних.Магазин КАК Магазин
	               |ИЗ
	               |	РегистрСведений.УчетнаяПолитикаМагазинов.СрезПоследних КАК УчетнаяПолитикаМагазиновСрезПоследних
	               |ГДЕ
	               |	УчетнаяПолитикаМагазиновСрезПоследних.ИспользоватьБиометрическийСканер = ИСТИНА
	               |	И УчетнаяПолитикаМагазиновСрезПоследних.Магазин.ПометкаУдаления = ЛОЖЬ
	               |	И УчетнаяПолитикаМагазиновСрезПоследних.Магазин.Блокирован = ЛОЖЬ";      
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Магазин");
	
	
КонецФункции


&НаКлиенте
Процедура МагазинНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор", Новый Структура("Ссылка", ПолучитьМагазиныИспользующиеБиометрику()));   
	Оповещение_ = Новый ОписаниеОповещения("МагазинЗавершениеВыбора",ЭтаФорма);
	ОткрытьФорму("Справочник.Магазины.ФормаВыбора", ПараметрыВыбора,ЭтаФорма,,,,Оповещение_);    
	
КонецПроцедуры

&НаКлиенте
Процедура МагазинЗавершениеВыбора(ДанныеВыбора, ДопПараметры) Экспорт
	Магазин = ДанныеВыбора; 
	МагазинПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КомандаЗарегистрировать(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;
    МагазинПриИзмененииНаСервере();
КонецПроцедуры
